// работа с переменными
"use strict";//прописывая эту переменную говорим, что робим в новом стандарте

 // 1. Объявление переменных
 let number1 = 5;
 let number1Str = 'Ivan';

 // это объявление константы
 const number2 = 10;

 //старый способ(уже не используется)
 var oldNumber = 11;
 //не используют потому что с var так нельзя(выведет ошибку(undefined))
 //пример(наз всплытие переменных, с let так можно делать!!!)
 console.log(oldNumrExampl);
 var oldNumrExampl = 3;

 //Еще почему не используют var:
 //1. let и const видно только в блоке ограничения фигурными скобками(а var нет)
 //2. В старых браузерах не поддерживается
 





